In [ ]:
############# 데이터 처리하기 4강 - 데이터 그룹화 함수 이해하기

In [63]:
df = pd.DataFrame({"key1":['a','a','b','b','a'],
                   "key2":['one','two','one','two','one'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})

In [64]:
df

      data1     data2 key1 key2
0 -0.485705 -1.333593    a  one
1 -0.054751 -1.085329    a  two
2  0.927053  1.017685    b  one
3  1.139995 -0.462261    b  two
4  0.650561  0.081268    a  one

In [65]:
grouped = df["data1"].groupby(df["key1"])
# df라는 DataFrame에서 data1 열의 사용하여 통계량을 계산할 것인데, 
# 이때 key1열의 값을 기준으로 데이터를 먼저 그룹화한 뒤에 이들 각각의 그룹들에 대하여 
# data1열의 통계량을 계산할 준비를 한 상태

In [66]:
grouped

In [67]:
grouped.mean()

key1
a    0.036702
b    1.033524
Name: data1, dtype: float64

In [68]:
# split - apply - combine

In [69]:
means = df["data1"].groupby([df["key1"], df["key2"]]).mean()

In [70]:
means

key1  key2
a     one     0.082428
      two    -0.054751
b     one     0.927053
      two     1.139995
Name: data1, dtype: float64

In [71]:
means.unstack()

key2       one       two
key1
a     0.082428 -0.054751
b     0.927053  1.139995

In [72]:
df.groupby("key1").mean()

         data1     data2
key1
a     0.036702 -0.779218
b     1.033524  0.277712

In [73]:
df

      data1     data2 key1 key2
0 -0.485705 -1.333593    a  one
1 -0.054751 -1.085329    a  two
2  0.927053  1.017685    b  one
3  1.139995 -0.462261    b  two
4  0.650561  0.081268    a  one

In [75]:
df.groupby("key1").count()

      data1  data2  key2
key1
a         3      3     3
b         2      2     2

In [77]:
df.groupby(["key1","key2"]).count()

           data1  data2
key1 key2
a    one       2      2
     two       1      1
b    one       1      1
     two       1      1

In [79]:
df1 = df.groupby(["key1","key2"])["data2"].mean()

In [80]:
df1.unstack()

key2       one       two
key1
a    -0.626162 -1.085329
b     1.017685 -0.462261

In [81]:
df.groupby(["key1","key2"])["data2"].mean()

key1  key2
a     one    -0.626162
      two    -1.085329
b     one     1.017685
      two    -0.462261
Name: data2, dtype: float64

In [82]:
df.groupby("key1")

In [83]:
for name, group in df.groupby("key1"):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.485705 -1.333593    a  one
1 -0.054751 -1.085329    a  two
4  0.650561  0.081268    a  one
b
      data1     data2 key1 key2
2  0.927053  1.017685    b  one
3  1.139995 -0.462261    b  two

In [85]:
for (k1,k2), group in df.groupby(["key1","key2"]):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0 -0.485705 -1.333593    a  one
4  0.650561  0.081268    a  one
a two
      data1     data2 key1 key2
1 -0.054751 -1.085329    a  two
b one
      data1     data2 key1 key2
2  0.927053  1.017685    b  one
b two
      data1     data2 key1 key2
3  1.139995 -0.462261    b  two

In [86]:
pieces = dict(list(df.groupby("key1")))

In [87]:
pieces

{'a':       data1     data2 key1 key2
 0 -0.485705 -1.333593    a  one
 1 -0.054751 -1.085329    a  two
 4  0.650561  0.081268    a  one, 'b':       data1     data2 key1 key2
 2  0.927053  1.017685    b  one
 3  1.139995 -0.462261    b  two}

In [88]:
pieces["b"]

      data1     data2 key1 key2
2  0.927053  1.017685    b  one
3  1.139995 -0.462261    b  two

In [90]:
df2 = pd.DataFrame(np.random.randn(5, 5), 
                   columns=['a', 'b', 'c', 'd', 'e'],
                   index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
map_dict = {'a': 'red', 'b': 'red', 'c': 'blue', 
            'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [92]:
df2

               a         b         c         d         e
Joe    -2.307205  0.865583  0.889355  0.279578 -0.823017
Steve   1.112000  2.595321 -0.563917  1.596768 -2.375554
Wes    -0.601181 -0.535614  0.738534  0.400911  0.178341
Jim     1.039731  0.818992 -0.353679  1.161029  0.168059
Travis -0.150073  1.390654 -0.464475  1.178391 -1.150596

In [93]:
map_dict

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [94]:
df2.groupby(map_dict, axis=1).sum()

            blue       red
Joe     1.168933 -2.264639
Steve   1.032851  1.331767
Wes     1.139445 -0.958454
Jim     0.807350  2.026781
Travis  0.713916  0.089986

In [95]:
map_s = pd.Series(map_dict)

In [96]:
df2.groupby(map_s, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

In [97]:
df

      data1     data2 key1 key2
0 -0.485705 -1.333593    a  one
1 -0.054751 -1.085329    a  two
2  0.927053  1.017685    b  one
3  1.139995 -0.462261    b  two
4  0.650561  0.081268    a  one

In [99]:
grouped = df.groupby("key1")

In [100]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [101]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     1.136266  1.414861
b     0.212942  1.479947

In [103]:
grouped.agg?

In [104]:
grouped.agg("std")

         data1     data2
key1
a     0.573627  0.755471
b     0.150573  1.046480

In [105]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.036702  0.573627 -0.485705 -0.270228 -0.054751  0.297905
b      2.0  1.033524  0.150573  0.927053  0.980289  1.033524  1.086760

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     0.650561   3.0 -0.779218  0.755471 -1.333593 -1.209461 -1.085329
b     1.139995   2.0  0.277712  1.046480 -0.462261 -0.092275  0.277712


           75%       max
key1
a    -0.502030  0.081268
b     0.647699  1.017685